of40/tutorials/rheoEFoam/EEI/PoissonBoltzmann/CrossSlot/0/theta
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      theta;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 );
 
boundaryField
{

    inlet_top
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0 );
    }
    inlet_down
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0 );
    }

    walls
    {
        type            zeroGradient;
    }
    
    outlet_left
    {
       type            zeroGradient;
    }
    outlet_right
    {
        type            zeroGradient;
    }
    
    "(top|base)"
    {
        type            empty;
    }
}

// ************************************************************************* //
